{
  "backend/main.mo": "Empty Motoko actor with no implemented logic.",
  "feature_evidence.json": "Feature evidence report listing menu-related feature requirements and associated files.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for various frontend files.",
  "frontend/index.css": "Tailwind base styles with light/dark theme OKLCH tokens and global background/foreground rules.",
  "frontend/index.html": "HTML entry point defining metadata and loading the React app root.",
  "frontend/src/App.tsx": "Main app component assembling all site sections with header and footer.",
  "frontend/src/components/ContactSection.tsx": "Contact section with location card, phone buttons, and opening hours display.",
  "frontend/src/components/GallerySection.tsx": "Gallery grid with modal preview supporting image enlargement and fallbacks.",
  "frontend/src/components/HeroSection.tsx": "Hero banner featuring cafe name, tagline, CTA buttons, and feature highlights.",
  "frontend/src/components/MenuImagesDialog.tsx": "Dialog showing a scrollable grid of menu screenshots with click-to-enlarge support.",
  "frontend/src/components/MenuSection.tsx": "Renders the menu section with accordion categories and items sourced from menuData, including images, badges, and pricing.",
  "frontend/src/components/Section.tsx": "Provides a reusable layout section with optional background styling and container wrapping.",
  "frontend/src/components/SiteFooter.tsx": "Displays the site footer with branding, location, contact info, and a link crediting caffeine.ai.",
  "frontend/src/components/SiteHeader.tsx": "Implements a responsive header with scroll-based styling, smooth section navigation, and mobile menu toggling.",
  "frontend/src/content/gallery.ts": "Exports an array of gallery images with src, alt text, and optional titles for the site's gallery section.",
  "frontend/src/content/menu.ts": "Defines menu item interfaces and exports structured menu data for breakfast, Italian dishes, pizza, and other categories.",
  "frontend/src/content/menuImages.ts": "Provides a list of menu image assets with alt text for use in the menu image viewer.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refetching dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an authentication context using Internet Identity, handling login, identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Exports an empty hook placeholder since the static site requires no backend queries.",
  "frontend/src/index.css": "Sets Tailwind layers and defines extensive OKLCH-based light/dark theme variables plus font imports and base element styles.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping App with React Query and Internet Identity providers.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors from CSS variables, extended theme options, plugins, and animations.",
  "project_state.json": "Describes the project state and requirements for building a single‑page cafe website with strict content and design constraints."
}