{
  "kind": "build_request",
  "title": "Replace Menu section content with user-provided menu screenshots",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-6",
      "text": "Replace the current Menu section data source with menu items, categories, variants, and prices taken strictly from the 12 user-uploaded menu screenshots (the screenshots are the single source of truth for menu content). Remove all currently hardcoded/invented menu content in frontend/src/content/menu.ts.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Put this menu there instead of that which you provided."
        ]
      },
      "acceptanceCriteria": [
        "frontend/src/content/menu.ts no longer contains the existing placeholder categories like \"Italian Specialties\", \"Sandwiches & Salads\", or invented items/descriptions.",
        "All menu categories/items/prices shown on the website are transcribed from (and match) the user-uploaded screenshots, with no additional items, no modified names, and no inferred prices.",
        "Where the screenshots show variant pricing (e.g., Half/Full; Medium/Large with inch sizes), the data model captures those variants so the UI can render them clearly.",
        "Where the screenshots indicate Veg/Non-Veg, the data model captures that indicator (e.g., a tag/flag) so the UI can display it in text/icon form."
      ]
    },
    {
      "id": "REQ-7",
      "text": "Update the Menu section UI (frontend/src/components/MenuSection.tsx) to correctly render the new menu structure from the screenshots, including support for multi-price variants (e.g., Half/Full and Medium/Large) and Veg/Non-Veg indicators, while keeping the existing accordion-based layout.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Put this menu there instead of that which you provided."
        ]
      },
      "acceptanceCriteria": [
        "MenuSection renders each category from the new menu data and displays items with either a single price or a clear variant price layout when multiple prices apply.",
        "MenuSection no longer displays Italian-only marketing copy; update the section description text to a generic menu description that matches the broader menu shown in the screenshots.",
        "Veg/Non-Veg markers are displayed consistently for items where the screenshots indicate them.",
        "The Menu section remains functional and responsive (accordion expands/collapses; layout does not overflow on mobile)."
      ]
    },
    {
      "id": "REQ-8",
      "text": "Add the 12 user-uploaded menu screenshots as static assets in the frontend and provide an optional in-page way for users to view the original menu images (e.g., a \"View menu images\" button that opens a modal/gallery). Use the exact uploaded filenames.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Put this menu there instead of that which you provided."
        ]
      },
      "acceptanceCriteria": [
        "All 12 screenshots are available as static files under the frontend public assets (no backend involvement) and referenced by their exact filenames.",
        "MenuSection includes an optional UI control that allows viewing the original screenshots in a readable way (modal/lightbox or dedicated gallery area).",
        "No stock images are introduced and no menu images are fetched from third-party sources."
      ]
    }
  ],
  "constraints": [
    "Do not change or add backend functionality; backend/main.mo should remain unchanged.",
    "Do not add any new menu items/prices/descriptions that are not present in the uploaded screenshots.",
    "Use English for all user-facing text.",
    "Do not edit files under frontend/src/components/ui or any other immutable paths listed in SYSTEM_CONTEXT; compose existing UI components instead."
  ],
  "nonGoals": [
    "Online ordering, cart/checkout, or payments.",
    "Reservation/booking functionality.",
    "Changing cafe contact details, gallery sources, or other sections beyond what is necessary to reflect the updated menu."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}